# HasBoundingBox Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementRecord..::..HasBoundingBox Method
ElementRecord Class See Also
---
Determines whether this element record has a bounding box.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool HasBoundingBox()
```

Visual Basic
---
```text
Public Function HasBoundingBox As Boolean
```

Visual C++
---
```text
public:
bool HasBoundingBox()
```

# ### Return Value
True if the element record has a bounding box or false otherwise.
# See Also
ElementRecord Class
Autodesk.Revit.DB Namespace